
## :x: Apply Failed

[CI link](https://github.com/NaokiHaba/aws-ecs-terraform/actions/runs/10320990432)



<pre><code>Error: creating ELBv2 Listener Rule: operation error Elastic Load Balancing v2: CreateRule, https response error StatusCode: 400, RequestID: c1f75f41-6958-45d3-894d-4c24879e04d0, api error ValidationError: Condition value &#39;*&#39; contains a character that is not valid

  with aws_lb_listener_rule.alb_listener_rule,
  on alb.tf line 27, in resource &#34;aws_lb_listener_rule&#34; &#34;alb_listener_rule&#34;:
  27: resource &#34;aws_lb_listener_rule&#34; &#34;alb_listener_rule&#34; {

Releasing state lock. This may take a few moments...</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
Acquiring state lock. This may take a few moments...
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0d3bc6321415261f2]
aws_security_group.ecs: Refreshing state... [id=sg-085b65b04939915ca]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-0c861b2c5fa1a1383]
aws_security_group.alb: Refreshing state... [id=sg-0dc0aa69fd5dd1046]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-013e3158ba1d87cb8]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-0d723ee54653a8d31]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-0e85ff5b730879868]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0d739af6509c77909]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0094ede6f5e9b43a2]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-051818b3ca2c1050c]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0be0afc03eb19635a]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0a24704fbcf978b51]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0bbc16a37d4945990]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0539410e12d384fea]
aws_security_group_rule.alb_to_ecs: Refreshing state... [id=sgrule-1428484681]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-02dc7c60bbde05715]
module.vpc.aws_eip.nat[1]: Refreshing state... [id=eipalloc-08d01b6dbc301047e]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-014f5e9d65c806c81]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0094ede6f5e9b43a21080289494]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-09f94a0ef2185be8f]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0ae73b39760ada660]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-02b5f438bd818005a]
module.vpc.aws_nat_gateway.this[1]: Refreshing state... [id=nat-068c3b626f7c89750]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0d3652fd8c583d1bc]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0d739af6509c779091080289494]
module.vpc.aws_route.private_nat_gateway[1]: Refreshing state... [id=r-rtb-0e85ff5b7308798681080289494]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_lb.alb will be created
  + resource "aws_lb" "alb" {
      + arn                                                          = (known after apply)
      + arn_suffix                                                   = (known after apply)
      + client_keep_alive                                            = 3600
      + desync_mitigation_mode                                       = "defensive"
      + dns_name                                                     = (known after apply)
      + drop_invalid_header_fields                                   = false
      + enable_deletion_protection                                   = false
      + enable_http2                                                 = true
      + enable_tls_version_and_cipher_suite_headers                  = false
      + enable_waf_fail_open                                         = false
      + enable_xff_client_port                                       = false
      + enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)
      + id                                                           = (known after apply)
      + idle_timeout                                                 = 60
      + internal                                                     = (known after apply)
      + ip_address_type                                              = (known after apply)
      + load_balancer_type                                           = "application"
      + name                                                         = "go-simple-server-alb"
      + name_prefix                                                  = (known after apply)
      + preserve_host_header                                         = false
      + security_groups                                              = [
          + "sg-0dc0aa69fd5dd1046",
        ]
      + subnets                                                      = [
          + "subnet-0a24704fbcf978b51",
          + "subnet-0be0afc03eb19635a",
        ]
      + tags_all                                                     = (known after apply)
      + vpc_id                                                       = (known after apply)
      + xff_header_processing_mode                                   = "append"
      + zone_id                                                      = (known after apply)

      + subnet_mapping (known after apply)
    }

  # aws_lb_listener.alb_listener will be created
  + resource "aws_lb_listener" "alb_listener" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 80
      + protocol          = "HTTP"
      + ssl_policy        = (known after apply)
      + tags_all          = (known after apply)

      + default_action {
          + order = (known after apply)
          + type  = "fixed-response"

          + fixed_response {
              + content_type = "text/plain"
              + message_body = "Fixed response page"
              + status_code  = "200"
            }
        }

      + mutual_authentication (known after apply)
    }

  # aws_lb_listener_rule.alb_listener_rule will be created
  + resource "aws_lb_listener_rule" "alb_listener_rule" {
      + arn          = (known after apply)
      + id           = (known after apply)
      + listener_arn = (known after apply)
      + priority     = (known after apply)
      + tags_all     = (known after apply)

      + action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }

      + condition {
          + host_header {
              + values = [
                  + "*",
                ]
            }
        }
    }

  # aws_lb_target_group.alb_target_group will be created
  + resource "aws_lb_target_group" "alb_target_group" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancer_arns                 = (known after apply)
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_anomaly_mitigation  = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "go-simple-server-target-group"
      + name_prefix                        = (known after apply)
      + port                               = 8080
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags_all                           = (known after apply)
      + target_type                        = "ip"
      + vpc_id                             = "vpc-0d3bc6321415261f2"

      + health_check {
          + enabled             = true
          + healthy_threshold   = 3
          + interval            = 30
          + matcher             = (known after apply)
          + path                = "/health_checks"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 5
          + unhealthy_threshold = 3
        }

      + stickiness (known after apply)

      + target_failover (known after apply)

      + target_group_health (known after apply)

      + target_health_state (known after apply)
    }

Plan: 4 to add, 0 to change, 0 to destroy.
aws_lb.alb: Creating...
aws_lb_target_group.alb_target_group: Creating...
aws_lb_target_group.alb_target_group: Creation complete after 3s [id=arn:aws:elasticloadbalancing:ap-northeast-1:533267095025:targetgroup/go-simple-server-target-group/365fcf4d3641bd97]
aws_lb.alb: Still creating... [10s elapsed]
aws_lb.alb: Still creating... [20s elapsed]
aws_lb.alb: Still creating... [30s elapsed]
aws_lb.alb: Still creating... [40s elapsed]
aws_lb.alb: Still creating... [50s elapsed]
aws_lb.alb: Still creating... [1m1s elapsed]
aws_lb.alb: Still creating... [1m11s elapsed]
aws_lb.alb: Still creating... [1m21s elapsed]
aws_lb.alb: Still creating... [1m31s elapsed]
aws_lb.alb: Still creating... [1m41s elapsed]
aws_lb.alb: Still creating... [1m51s elapsed]
aws_lb.alb: Still creating... [2m1s elapsed]
aws_lb.alb: Still creating... [2m11s elapsed]
aws_lb.alb: Still creating... [2m21s elapsed]
aws_lb.alb: Still creating... [2m31s elapsed]
aws_lb.alb: Still creating... [2m41s elapsed]
aws_lb.alb: Still creating... [2m51s elapsed]
aws_lb.alb: Still creating... [3m1s elapsed]
aws_lb.alb: Still creating... [3m11s elapsed]
aws_lb.alb: Creation complete after 3m17s [id=arn:aws:elasticloadbalancing:ap-northeast-1:533267095025:loadbalancer/app/go-simple-server-alb/7dba8af0f101d717]
aws_lb_listener.alb_listener: Creating...
aws_lb_listener.alb_listener: Creation complete after 1s [id=arn:aws:elasticloadbalancing:ap-northeast-1:533267095025:listener/app/go-simple-server-alb/7dba8af0f101d717/b0567004bccb307c]
aws_lb_listener_rule.alb_listener_rule: Creating...

Error: creating ELBv2 Listener Rule: operation error Elastic Load Balancing v2: CreateRule, https response error StatusCode: 400, RequestID: c1f75f41-6958-45d3-894d-4c24879e04d0, api error ValidationError: Condition value '*' contains a character that is not valid

  with aws_lb_listener_rule.alb_listener_rule,
  on alb.tf line 27, in resource "aws_lb_listener_rule" "alb_listener_rule":
  27: resource "aws_lb_listener_rule" "alb_listener_rule" {

Releasing state lock. This may take a few moments...

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform","PRNumber":5,"Program":"tfcmt","SHA1":"0def08ad91e88d789e96f2e830c2e0d258295882","Vars":{},"WorkflowName":"Terraform CI/CD"} -->